data = {
    'buttons': {
        'main_kb': {
            'trade': '📊 Торгова платформа',
            'wallet': '💰 Гаманець',
            'change_lang': '🌍 Змінити мову',
            'change_currency': '💵 Змінити валюту',
            'support': '🛠️ Підтримка',
            'verif': '📄 Верифікація',
            'license': '📃 Ліцензія'
        },
        'wallet_kb': {
            'top_up': '💰 Поповнити',
            'withdraw': '💸 Вивести',
            'promocode': '📝 Промокод',
            'back': '🔙 Назад',
        },
        'top_up_kb': {
            'card': '💳 Картка',
            'crypto': '💰 Криптовалюта',
            'back': '🔙 Назад',
        },
        'support_kb': {
            'check_payment': '✅ Перевірити оплату',
            'support': '🛠️ Підтримка',
        },
        'back_kb': {
            'back': '🔙 Назад',
        },
        'select_lang_kb': {
            'set_lang_ru': '🇷🇺 Російська',
            'set_lang_en': '🇬🇧 Англійська',
            'set_lang_pl': '🇵🇱 Польська',
            'set_lang_ua': '🇺🇦 Українська',
            'back': '🔙 Назад',
        },
        'select_currency_kb': {
            'set_currency_pln': '🇵🇱 PLN',
            'set_currency_eur': '🇪🇺 EUR',
            'set_currency_rub': '🇷🇺 RUB',
            'set_currency_uah': '🇺🇦 UAH',
            'set_currency_byn': '🇧🇾 BYN',
            'set_currency_ils': '🇮🇱 ILS',
            'back': '🔙 Назад',
        },
        'trade_kb': {
            'crypto': "💰 Криптовалюти",
            'back': "🔙 Назад",
        },
        'support_page_kb': {
            'support': "🛠️ Підтримка",
            'back': "🔙 Назад",
        },
        'main_reply_kb': {
            'main': '📂 Портфель'
        },
        'verif_kb': {
            'get_verif': '📄 Пройти Верифікацію'
        }
    },

    'text': {
        'main_text': '''👋 Ласкаво просимо до мультикриптовалютної крипто-біржі OKX Trading\n
OKX Trading можна використовувати як гаманець для зручних операцій з основними криптовалютами''',
        'greeting': '''
📂 Портфель:

💵 Баланс: {} {}
🗣 Ім'я: {}

📝Верифікація: {}

🍀 Рефералів: {}
🟢 Активних угод на платформі: {}

{}
''',

        'wallet': '💰 Ваш гаманець:\n\n🆔 Ваш ідентифікатор користувача: {}\n🏦 Баланс: {} {}\n\n',
        'change_lang': 'Виберіть мову:',
        'change_currency': 'Виберіть валюту:',
        'select_payment': 'Виберіть спосіб оплати:',
        'enter_amount': 'Введіть суму:',
        'card_deposit_info': '''
🤵 Для поповнення балансу

💳 Реквізити : {}
💬 Коментар : BLI-ZATO:{}

⚠️Реквізити дійсні протягом 20 хвилин після запиту, якщо ви не встигли оплатити протягом зазначеного часу, зробіть ще один запит реквізитів.⚠️

⚠️Натисніть на реквізити або коментар, щоб скопіювати!

⚠️Якщо ви не можете вказати коментар, після оплати надішліть чек/скріншот або ж квитанцію до технічної підтримки.

⚠️ 🛠 Тех. підтримка - @OKXsupport_official

З повагою, OKX Trading''',
        'select_crypto_currency': 'Виберіть криптовалюту:',
        'crypto_deposit_details': '''📍 Для вашої зручності надаємо можливість поповнення балансу через\
{}. Будь ласка, відправте будь-яку суму від {} {} на унікальну адресу:

{}

Наш бот автоматично перерахує поточний курс {} і зарахує кошти на ваш баланс після першого підтвердження у мережі.\
Після поповнення ви отримаєте повідомлення про зарахування коштів 🚀

Дякуємо за вибір наших послуг! У разі питань звертайтеся до нашої підтримки. 🌐''',
        'enter_withdrawal_amount': 'Введіть суму для виведення:',
        'withdraw_error': "❌ Помилка\n💸Введіть суму для виведення:'",
        'promocode_error': "❌ Цього промокоду не існує",
        'check_payment': "💸Кошти будуть зараховані на ваш рахунок автоматично після оплати",

        'support': '''📘 Ви можете відкрити заявку до служби підтримки OKX Trading.
Фахівець відповість у найближчий час.
Для швидшого вирішення проблеми опишіть своє звернення максимально чітко, якщо потрібно, можна надати файли або зображення.

Правила звернення до техпідтримки:

1 - При першому зверненні, будь ласка, представтеся
2 - Опишіть проблему своїми словами
3 - Будьте ввічливими, і до вас будуть ввічливими!''',
        'select_crypto_investment': '💠Виберіть область для інвестування капіталу',
        'trade_faq': '''Як це працює?

• Рекомендуємо вивчити курси перед інвестицією або мати досвідченого наставника.
• Інвестиції здійснюються в короткостроковому режимі.
• Виберіть область для інвестування, потім суму і час позиції, дочекайтесь результатів інвестування.
• Позиції відкриваються зі 100Х кредитним плечем.
• Наша компанія не несе відповідальності за ризики, пов'язані зі зростанням/падінням котирувань.''',
    'enter_withdraw_amount': "Введіть суму для виводу:",
    'enter_promocode': "введіть промокод:",
    'promocode_error': "такого промокоду не існує або він уже використаний",
    'promocode_success': "Промокод успішно активовано. Ви отримали {} USD",
    'invalid_amount': "Некоректна сума. Мінімальна сума: від {} {}",
'success_withdrawal': '''💸 Виведення коштів у розмірі {} {} буде здійснено на реквізити, з яких востаннє було поповнення\n
Дякуємо, що ви з нами!''',
'withdraw_accept': '''✅ Ваше виведення було схвалене\n
З повагою, OKX''',
'withdraw_decline': '''❌ Ваше виведення було відхилене, зверніться до технічної підтримки:\n
{}\n
З повагою, OKX''',
'withdraw_support': '''❌ Для виведення коштів зверніться до підтримки за контактом нижче:\n
{}\n
З повагою, OKX''',
'order_success': '''✅ Ваша угода була успішною:
Сума: {} {}
Виграш: +{} {}
Валюта: {}
Час закриття угоди: {}''',
'order_fail': '''❌ Ваша угода була неуспішною:
Сума: {} {}
Програш: {} {}
Валюта: {}
Час закриття угоди: {}''',
'bidding_blocked': '''❌Сталася помилка

Будь ласка, зверніться в техпідтримку \n
{}\n
☝Технічна підтримка!
Дякуємо за розуміння!
З повагою.OKX''',
'withdrawal_blocked': '''❌Сталася помилка

Будь ласка, зверніться в техпідтримку \n
{}\n
☝Технічна підтримка!
Дякуємо за розуміння!
З повагою.OKX''',
'verif': '''❓Верифікація акаунту потрібна для проведення фінансових операцій великого розміру.
❗️Верифікацію можна пройти тільки за допомогою технічної підтримки.
❗️Для верифікації технічна підтримка може попросити ваші паспортні дані для підтвердження особи \
та для підтвердження вашого повноліття.'''
    }
}